/**
 * @file 记录了 ascii 字符串的常量定义
 */

/**
 * @constant ASCII ASCII 字符常量
 * @remarks
 * - **0-9**: 48-47
 * - **A-Z**: 65-90
 * - **a-z**: 97-122
 * - 小写**-大写=32
 */
export const ASCII = {
  /* 空格 */
  SPACE: 32,

  /* 换行 */
  NEWLINE: 10,

  /* 回车 */
  RETURN: 13,

  /* 0-9 */
  NUM_0: 48,
  NUM_1: 49,
  NUM_2: 50,
  NUM_3: 51,
  NUM_4: 52,
  NUM_5: 53,
  NUM_6: 54,
  NUM_7: 55,
  NUM_8: 56,
  NUM_9: 57,

  /* A-Z */
  A: 65,
  B: 66,
  C: 67,
  D: 68,
  E: 69,
  F: 70,
  G: 71,
  H: 72,
  I: 73,
  J: 74,
  K: 75,
  L: 76,
  M: 77,
  N: 78,
  O: 79,
  P: 80,
  Q: 81,
  R: 82,
  S: 83,
  T: 84,
  U: 85,
  V: 86,
  W: 87,
  X: 88,
  Y: 89,
  Z: 90,

  /* a-z */
  a: 97,
  b: 98,
  c: 99,
  d: 100,
  e: 101,
  f: 102,
  g: 103,
  h: 104,
  i: 105,
  j: 106,
  k: 107,
  l: 108,
  m: 109,
  n: 110,
  o: 111,
  p: 112,
  q: 113,
  r: 114,
  s: 115,
  t: 116,
  u: 117,
  v: 118,
  w: 119,
  x: 120,
  y: 121,
  z: 122
};
